## staging: aggregate_metrics_lambda
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`



```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.write_cloudwatch_metrics will be created
  + resource "aws_iam_policy" "write_cloudwatch_metrics" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CovidAlertWriteCloudwatchMetrics"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "cloudwatch:PutMetricData"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.aggregator_write_cloudwatch_metrics will be created
  + resource "aws_iam_role_policy_attachment" "aggregator_write_cloudwatch_metrics" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "aggregate_lambda_role"
    }

  # aws_lambda_function.aggregate_metrics will be updated in-place
  ~ resource "aws_lambda_function" "aggregate_metrics" {
        id                             = "aggregate_metrics"
      ~ last_modified                  = "2021-06-28T15:44:17.768+0000" -> (known after apply)
      ~ source_code_hash               = "76+wKc7vwzzG/oZRU/vQYN2Iok7MbSYyYoOMAn/1Kr8=" -> "m/+DcDKWk0VL0GxrL3Fs7sjCmwuVjUdYc49xfm6zR0A="
        tags                           = {}
        # (17 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>